[
  {
    "name": "Tokaido Main",
    "abbrev": "A",
    "image": "https://media.discordapp.net/attachments/734604988717858846/741769617915248750/225.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/741770358029287545/JRW_kinki-A.png",
    "colour": "0071be",
    "overview": "The Tōkaidō Main Line (東海道本線, Tōkaidō-honsen) is a major Japanese railway line of the Japan Railways Group (JR Group) network, connecting Tokyo and Kōbe stations. It is 515.4 km long, not counting its many freight feeder lines around the major cities. The high-speed Tōkaidō Shinkansen largely parallels the line. It’s the oldest railway line in Japan, dating back to Meiji era. It’s co-owned by JR East, JR Central, and JR West.",
    "route": "Tokyo to Kobe",
    "stations": 173,
    "maximum_speed": "130 km/h",
    "length (km)": 589.5,
    "gauge (mm)": 1067,
    "opened": "14 October, 1872"
  },
  {
    "name": "Kosei",
    "abbrev": "B",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741774998175219752/JR_West_223-2000_S.Rapid_Tsuruga_20190607.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/741782582555050054/Kosei.png",
    "colour": "00a7e3",
    "overview": "The Kosei Line (湖西線, Kosei-sen) is a commuter rail line in Osaka-Kobe-Kyoto Metropolitan Area, operated by West Japan Railway Company (JR West). The line was completed in 1974 by the former Japanese National Railways (JNR) to provide faster access from the Kansai region to the Hokuriku region. It originates at Yamashina Station in Yamashina-ku, Kyoto and ends at Ōmi-Shiotsu Station in Nagahama, Shiga. Its name means \"the line to the west of the lake,\" indicating that it approximately parallels the western shore of Biwako. Trains continue from Yamashina to Kyoto Station on the Tōkaidō Main Line for convenient transfer to lines serving the Kansai as well as the Tōkaidō Shinkansen.",
    "route": "Yamashina to Ōmi-Shiotsu",
    "stations": 21,
    "maximum_speed": "130 km/h",
    "length (km)": 74.1,
    "gauge (mm)": 1067,
    "opened": "20 July, 1974"
  },
  {
    "name": "Nara",
    "abbrev": "D",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741771663250685952/JRW_series221_Nara.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/741771665553489930/Nara.png",
    "colour": "bd7d19",
    "overview": "The Nara Line (奈良線, Nara-sen) is a commuter rail line in the Osaka–Kobe–Kyoto metropolitan area. Its official termini are Kizu Station in Kizugawa and Kyōto Station in Kyoto, within Kyoto Prefecture; however, all trains continue past Kizu on the Yamatoji Line (Kansai Main Line) to Nara Station in Nara, Nara Prefecture. Its primary role is that of an intercity-suburban commuter line, ferrying people to and from work and school in Kyoto and Nara; it is also well-used by tourists holding the Japan Rail Pass, as visiting the historical landmarks of Uji and Nara makes an easy day-trip from Kyoto.",
    "route": "Kizu to Kyōto",
    "stations": 19,
    "maximum_speed": "110 km/h",
    "length (km)": 34.7,
    "gauge (mm)": 1067,
    "opened": "18 August, 1879"
  },
  {
    "name": "Osaka Loop",
    "abbrev": "O",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741773241764413490/1280px-323.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/741773241147850752/Osaka_Loop.png",
    "colour": "e73042",
    "overview": "The Osaka Loop Line (大阪環状線, Ōsaka kanjō-sen) is a railway loop line in Japan operated by the West Japan Railway Company (JR West). It encircles central Osaka. This loop line consists of two tracks around the heart of metropolitan Osaka. All trains consist of 8 carriages, with distinctive orange colour with white JR graphics on the front, rear and sides. The train schedule varies, but on average, two trains leave Tennōji Station and Ōsaka Station every seven minutes, in opposite directions.",
    "route": "Passes through Ōsaka, Shin-Imamiya, Tennōji",
    "stations": 19,
    "maximum_speed": "100 km/h",
    "length (km)": 21.7,
    "gauge (mm)": 1067,
    "opened": "28 May, 1895"
  },
  {
    "name": "Sakurajima",
    "abbrev": "P",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741773447981694986/Train_at_Sakurajima_Station.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/741773441019150336/Sakurajima.png",
    "colour": "0b318e",
    "overview": "The Sakurajima Line (桜島線, Sakurajima-sen) is a railway line in Osaka, Japan connecting Nishikujō Station to Sakurajima Station. It is also referred to as the JR Yumesaki Line (JRゆめ咲線). The entire line is within Konohana-ku, Osaka, and connects the Osaka Loop Line to Universal Studios Japan (USJ). The nickname \"Yumesaki Line\" was determined in a public poll upon the opening of USJ and the Universal City station. While it was not the first choice, its pleasant sound together with the vision of the area around the Sakurajima Line and USJ being a place where Osaka's dreams were continuing to be born made it the selected choice. The line is used primarily by a mix of factory workers and tourists. There is also freight traffic operating between Suita and Ajikawaguchi.",
    "route": "Nishikujō to Sakurajima",
    "stations": 4,
    "maximum_speed": "95 km/h",
    "length (km)": 4.1,
    "gauge (mm)": 1067,
    "opened": "5 April, 1898"
  },
  {
    "name": "Kansai Main",
    "abbrev": "V",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741774915845226557/8-Kansai-Main-Line-Nagoya1.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/741775007604015104/Kansai_Main.png",
    "colour": "4c3a93",
    "overview": "The Kansai Main Line (関西本線, Kansai-honsen, also called the \"Kansai Line\") is a railway line in Japan, which connects Nagoya Station with JR Namba Station in Osaka. It is jointly run by the Central Japan Railway Company (JR Central) and West Japan Railway Company (JR West), with the boundary between both companies being located at Kameyama Station in Kameyama, Mie. The section from Kamo Station west to JR Namba Station is electrified and a part of the JR West \"Urban Network\", and is nicknamed the Yamatoji Line. Despite its name, for much of its length it is a very local line with mainly single track sections and no regular express services.",
    "route": "Nagoya to JR Namba",
    "stations": 52,
    "maximum_speed": "120 km/h",
    "length (km)": 174.9,
    "gauge (mm)": 1067,
    "opened": "14 May, 1889"
  },
  {
    "name": "JR Tozai",
    "abbrev": "H",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741775814542229534/JRW_series207_Tozai.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/741775807718096986/JR_Tozai.png",
    "colour": "e73082",
    "overview": "The JR Tōzai Line (JR東西線, Jei-āru Tōzai-sen) is one of several commuter rail lines and services in the Osaka-Kobe-Kyoto Metropolitan Area. The line, whose name literally means \"east-west\", runs underground through central Osaka and connects the Gakkentoshi Line at Kyobashi Station in Osaka and the JR Takarazuka Line and the JR Kobe Line at Amagasaki. All stations on this line are in the city of Osaka, except for the western terminus in Amagasaki, Hyōgo Prefecture.",
    "route": "Kyobashi to Amagasak",
    "stations": 9,
    "maximum_speed": "90 km/h",
    "length (km)": 12.5,
    "gauge (mm)": 1067,
    "opened": "8 March, 1997"
  },
  {
    "name": "Kansai Airport",
    "abbrev": "S",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741777333345714266/1280px-JR_West_281_Haruka.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/741777124083630191/Kansai_Airport.png",
    "colour": "0071be",
    "overview": "The Kansai Airport Line is a railway line between Hineno Station and Kansai Airport Station in Japan. It serves as a primary airport rail link for Kansai International Airport, located in Osaka Bay. It’s separated as an independent line from Hanwa Line in Hineno Station, and traverses between Kansai Airport Station and Rinku Town Station via Sky Gate Bridge R (a.k.a. Kansai International Airport Access Bridge). It also shares the rail with Nankai Electric Railway’s Nankai Airport Line. On September 4, 2018, the Sky Gate Bridge R was severely damaged in a conflict with an aviation fuel tanker due to Typhoon Jebi, which directly caused the Kansai Airport Line to a halt. It later managed to resume service after 2 weeks, and made a full recovery in service on April 8, 2019.",
    "route": "Hineno to Kansai Airport",
    "stations": 3,
    "maximum_speed": "130 km/h",
    "length (km)": 11.1,
    "gauge (mm)": 1067,
    "opened": "15 June, 1994"
  },
  {
    "name": "Hanwa",
    "abbrev": "R",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741781330643386368/JRWseries225-5115.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/741782580193525780/Hanwa.png",
    "colour": "f5a200",
    "overview": "The Hanwa Line (阪和線, Hanwa-sen) is a commuter rail line in the Osaka-Kobe-Kyoto Metropolitan Area, owned and operated by West Japan Railway Company (JR West). The 61.3-kilometre (38.1 mi) line runs between Osaka and Wakayama, Japan and has a 1.7-kilometre branchline in a southern Osaka suburb. The name is taken from the first syllables of Osaka and Wakayama. The terminus of the line in Osaka is Tennōji Station in Tennōji-ku where most of the commuter trains on the line originate and terminate. However, many intercity limited express and rapid trains extend to the Osaka Loop Line beyond Tennōji. The terminus in Wakayama is Wakayama Station. Some trains from Osaka terminate before Wakayama and some spur off to Kansai Airport Station on the Kansai Airport Line from Hineno Station. Tracks are connected to the Kisei Main Line and some trains continue on from there.",
    "route": "Tennōji to Wakayama, Ōtori to Higashi-Hagoromo",
    "stations": 36,
    "maximum_speed": "120 km/h",
    "length (km)": 63.0,
    "gauge (mm)": 1067,
    "opened": "18 July, 1929"
  },
  {
    "name": "San'in Main",
    "abbrev": "E",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741782886260277329/Amarube_bridge-Kiha189.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/741782852655644678/800px-JRW_kinki-E.svg.png",
    "colour": "7c86c1",
    "overview": "The Sanin Main Line (山陰本線, San'in-honsen) is a railway line in western Japan, which connects Kyoto and Shimonoseki, Yamaguchi. It is the major railway line of the San'in region, approximately paralleling the Japan Sea, crossing Kyoto, Hyōgo, Tottori, Shimane, and Yamaguchi prefectures. The main portion from Kyoto to Hatabu is the longest single continuous railway line in Japan at 673.8 km, although no regularly scheduled train operates over the entire line. The section between Kyoto and Sonobe, connecting Kyoto and its northern suburbs, is a part of JR West's Urban Network and is nicknamed the Sagano Line.",
    "route": "Kyoto to Hatabu",
    "stations": 161,
    "maximum_speed": "130 km/h",
    "length (km)": 676.0,
    "gauge (mm)": 1067,
    "opened": "15 February, 1897"
  }
]