[
  {
    "name": "Tohoku",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741380290257354757/Tohoku.jpg",
    "icon": "https://cdn.discordapp.com/attachments/734604988717858846/741380779334172692/JR_East.png",
    "colour": "2ab59e",
    "overview": "The Tōhoku Shinkansen (東北新幹線, literally \"northeastern Shinkansen\") is a Japanese high-speed Shinkansen rail line, connecting Tokyo with Aomori in Aomori Prefecture in a route length of 674.9 km, making it Japan's longest Shinkansen line. It runs through the more sparsely populated Tōhoku region of Japan's main island, Honshu, and was extended as the Hokkaido Shinkansen through the Seikan Tunnel to Shin-Hakodate-Hokuto (this section opened March 2016) and on to Sapporo by 2030. It has two Mini-shinkansen branch lines, the Yamagata Shinkansen and Akita Shinkansen. The line is operated by East Japan Railway Company (JR East).",
    "route": "Tokyo to Shin-Aomori",
    "stations": 23,
    "maximum_speed": "320 km/h",
    "length (km)": 674.9,
    "gauge (mm)": 1435,
    "rolling_stock": "E2 series, E3 series, E5 series, E6 series, H5 series",
    "opened": "23 June, 1982",
    "operator": "JR East"
  },
  {
    "name": "Akita",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741380257306902569/Akita.jpg",
    "icon": "https://cdn.discordapp.com/attachments/734604988717858846/741380779334172692/JR_East.png",
    "colour": "e9415b",
    "overview": "The Akita Shinkansen (秋田新幹線) is a Mini-shinkansen rail line in Japan. Serving the Kantō and Tōhoku Regions of the country, it links Tokyo and Akita in Akita prefecture. From Tokyo to Morioka in Iwate prefecture, it operates on the Tōhoku Shinkansen tracks. From Morioka to Ōmagari, it uses the Tazawako Line tracks. The section from Ōmagari to Akita use the Ōu Main Line tracks. Services consist of Komachi trains formed of 7-car E6 series mini-shinkansen sets coupled with E5 series Hayabusa trains for the portion of the journey between Tokyo and Morioka.",
    "route": "Morioka to Akita",
    "stations": 11,
    "maximum_speed": "130 km/h",
    "length (km)": 127.3,
    "gauge (mm)": 1435,
    "rolling_stock": "E6 series",
    "opened": "23 June, 1982",
    "operator": "JR East"
  },
  {
    "name": "Yamagata",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741380283420377179/Yamagata.jpg",
    "icon": "https://cdn.discordapp.com/attachments/734604988717858846/741380779334172692/JR_East.png",
    "colour": "422f7e",
    "overview": "The Yamagata Shinkansen (山形新幹線) is a Mini-shinkansen route in Japan, operated by East Japan Railway Company (JR East). It provides service between Tokyo and Shinjō in Yamagata Prefecture over the tracks of the Tohoku Shinkansen and the Ōu Main Line. The term Yamagata Shinkansen refers to the segment that connects Fukushima and Shinjō. Because the shinkansen trains share tracks with regular service trains, it is often referred to as a \"mini-shinkansen\".",
    "route": "Fukushima to Shinjō",
    "stations": 11,
    "maximum_speed": "130 km/h",
    "length (km)": 148.6,
    "gauge (mm)": 1435,
    "rolling_stock": "E3 series",
    "opened": "1 July, 1992",
    "operator": "JR East"
  },
  {
    "name": "Hokuriku",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741380260091789392/Hokuriku.jpg",
    "icon": "https://cdn.discordapp.com/attachments/734604988717858846/741380779334172692/JR_East.png",
    "colour": "224ebb",
    "overview": "The Hokuriku Shinkansen (北陸新幹線) is a high-speed shinkansen railway line jointly operated by East Japan Railway Company (JR East) and West Japan Railway Company (JR West), connecting Tokyo with Kanazawa in the Hokuriku region of Japan. The first section, between Takasaki and Nagano in Nagano Prefecture, opened on 1 October 1997, originally called the Nagano Shinkansen (長野新幹線). The extension to Toyama in Toyama Prefecture and Kanazawa in Ishikawa Prefecture opened on 14 March 2015. Construction of a further section onward to Fukui and Tsuruga in Fukui Prefecture commenced in 2012, with scheduled opening in fiscal 2022. The route of the final section to Shin-Osaka was decided on 20 December 2016 as the Obama–Kyoto route, with construction expected to begin in 2030 and take 15 years.",
    "route": "Takasaki to Kanazawa",
    "stations": 13,
    "maximum_speed": "260 km/h",
    "length (km)": 345.5,
    "gauge (mm)": 1435,
    "rolling_stock": "E7 series, W7 series",
    "opened": "1 October, 1997",
    "operator": "JR East, JR West"
  },
  {
    "name": "Joetsu",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741380263149305916/Joetsu.jpg",
    "icon": "https://cdn.discordapp.com/attachments/734604988717858846/741380779334172692/JR_East.png",
    "colour": "f0f1ea",
    "overview": "The Jōetsu Shinkansen (上越新幹線) is a high-speed shinkansen railway line connecting Tokyo and Niigata, Japan, via the Tōhoku Shinkansen, operated by the East Japan Railway Company (JR East). Despite its name, the line does not pass through the city of Joetsu or the historical Jōetsu region, which instead are served by the Hokuriku Shinkansen.",
    "route": "Tokyo to Niigata",
    "stations": 10,
    "maximum_speed": "240 km/h",
    "length (km)": 269.5,
    "gauge (mm)": 1435,
    "rolling_stock": "E2 series, E4 series, E7 series",
    "opened": "15 November, 1982",
    "operator": "JR East"
  },
  {
    "name": "Tokaido",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741380282917060638/Tokaido.jpg",
    "icon": "https://cdn.discordapp.com/attachments/734604988717858846/741380777518039210/JR_Central.png",
    "colour": "f0f1ea",
    "overview": "The Tōkaidō Shinkansen (Japanese: 東海道新幹線) is a Japanese high-speed Shinkansen line, opened in 1964 between Tokyo and Shin-Ōsaka. Since 1987 it has been operated by the Central Japan Railway Company (JR Central), prior to that by Japanese National Railways (JNR). It is the oldest high-speed rail system in the world and one of the most heavily used.",
    "route": "Tokyo to Shin-Osaka",
    "stations": 17,
    "maximum_speed": "285 km/h",
    "length (km)": 515.4,
    "gauge (mm)": 1435,
    "rolling_stock": "N700A series, N700S series",
    "opened": "1 October, 1964",
    "operator": "JR Central"
  },
  {
    "name": "Sanyo",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741380271051505674/Sanyo.jpg",
    "icon": "https://cdn.discordapp.com/attachments/734604988717858846/741380782559461436/JR_West.png",
    "colour": "f0f1ea",
    "overview": "The San'yō Shinkansen (山陽新幹線) is a line of the Japanese Shinkansen high-speed rail network, connecting Shin-Osaka in Osaka with Hakata Station in Fukuoka, the two largest cities in western Japan. Operated by the West Japan Railway Company (JR West), it is a westward continuation of the Tōkaidō Shinkansen. The Kyushu Shinkansen continues south of Hakata to Kagoshima. The San'yō Shinkansen connects Hakata with Osaka in two and a half hours. Some Nozomi trains operate continuously on San'yō and Tōkaidō Shinkansen lines, connecting Tokyo and Hakata in five hours.",
    "route": "Shin-Ōsaka to Hakata",
    "stations": 19,
    "maximum_speed": "300 km/h",
    "length (km)": 553.7,
    "gauge (mm)": 1435,
    "rolling_stock": "500 series, 700 series, N700 series",
    "opened": "15 March, 1972",
    "operator": "JR West"
  },
  {
    "name": "Hokkaido",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741380255499157675/Hokkaido.jpg",
    "icon": "https://cdn.discordapp.com/attachments/734604988717858846/741380780709773332/JR_Hokkaido.png",
    "colour": "2ab59e",
    "overview": "The Hokkaidō Shinkansen (北海道新幹線) is a Japanese high-speed shinkansen rail line that links up with the Tōhoku Shinkansen in northern Aomori Prefecture in Honshu and continues on into the interior of Hokkaido through the undersea Seikan Tunnel. Construction started in May 2005, and the initial Shin-Aomori to Shin-Hakodate-Hokuto section opened on 26 March 2016. Extension of the line to Sapporo is scheduled to open by fiscal year 2030. The line is operated by the Hokkaido Railway Company (JR Hokkaido).",
    "route": "Shin-Aomori to Shin-Hakodate-Hokuto",
    "stations": 4,
    "maximum_speed": "260 km/h",
    "length (km)": 148.9,
    "gauge (mm)": 1435,
    "rolling_stock": "E5 series, H5 series",
    "opened": "26 March, 2016",
    "operator": "JR Hokkaido"
  },
  {
    "name": "Kyushu",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/741380264369979412/Kyushu.jpg",
    "icon": "https://cdn.discordapp.com/attachments/734604988717858846/741382308615159868/JR_Kyushu.png",
    "colour": "a51f1e",
    "overview": "The Kyūshū Shinkansen (九州新幹線) is a Japanese high-speed railway line between the cities of Fukuoka and Kagoshima in Kyushu, running parallel to the existing Kagoshima Main Line and operated by JR Kyushu. It is an extension of the San'yō Shinkansen from Honshu.",
    "route": "Hakata to Kagoshima-Chūō",
    "stations": 12,
    "maximum_speed": "260 km/h",
    "length (km)": 288.9,
    "gauge (mm)": 1435,
    "rolling_stock": "800 series, N700 series",
    "opened": "13 March, 2004",
    "operator": "JR Kyushu"
  }
]