[
  {
    "name": "E5",
    "colour": "2ab59e",
    "link": "https://cdn.discordapp.com/attachments/734604988717858846/738958072214585425/E5.jpg",
    "overview": "The E5 series is a Japanese Shinkansen high-speed train type operated by East Japan Railway Company (JR East) on Tōhoku Shinkansen services since 5 March 2011 and on Hokkaido Shinkansen services since 26 March 2016. A total of 59 10-car sets are on order, with three sets in service in time for the start of new Hayabusa services to Shin-Aomori in March 2011.",
    "constructed": 2009,
    "formation": "10 cars",
    "capacity": "723 (650 Standard, 55 Green, 18 Gran Class)",
    "maximum_speed": "320 km/h (Service) / 335 km/h (Design)",
    "acceleration": "1.71 km/(h⋅s)",
    "length (m)": 253,
    "gauge (mm)": 1435,
    "lines_served": "Tōhoku Shinkansen, Hokkaido Shinkansen"
  },
  {
    "name": "E6",
    "colour": "e9415b",
    "link": "https://cdn.discordapp.com/attachments/734604988717858846/738958074592624700/E6.jpg",
    "overview": "The E6 series is a Japanese Shinkansen high-speed train type operated by East Japan Railway Company (JR East) on Komachi \"mini-shinkansen\" services on the Tōhoku Shinkansen and Akita Shinkansen from Tokyo to Akita since 16 March 2013. A pre-series set was delivered in June 2010 for extensive testing, with 23 full-production sets delivered between November 2012 and spring 2014. The 7-car E6 series trains operate in conjunction with E5 series or H5 series (since March 2016) 10-car trains, initially on just four return services daily from 16 March 2013.",
    "constructed": "2010-2014",
    "formation": "7 cars",
    "capacity": "338 (315 Standard, 23 Green)",
    "maximum_speed": "320 km/h (Tōhoku Shinkansen) / 130 km/h (Akita Shinkansen)",
    "acceleration": "1.71 km/(h⋅s)",
    "length (m)": 148.65,
    "gauge (mm)": 1435,
    "lines_served": "Tōhoku Shinkansen, Akita Shinkansen"
  },
  {
    "name": "E7",
    "colour": "224ebb",
    "link": "https://cdn.discordapp.com/attachments/734604988717858846/738958077658923078/E7.jpg",
    "overview": "The E7 series is a Japanese Shinkansen high-speed train type operated by East Japan Railway Company (JR East) on the Hokuriku Shinkansen since 15 March 2014. It also operates on the Jōetsu Shinkansen following the March 2019 timetable revision. Jointly developed alongside the similar JR West W7 series, the first E7 series trains were delivered in late 2013.",
    "constructed": 2013,
    "formation": "12 cars",
    "capacity": "934 (853 Standard, 63 Green, Gran 18)",
    "maximum_speed": "260 km/h (Service) / 275 km/h (Design)",
    "acceleration": "1.6 km/(h⋅s)",
    "length (m)": 300.25,
    "gauge (mm)": 1435,
    "lines_served": "Hokuriku Shinkansen, Jōetsu Shinkansen"
  },
  {
    "name": "N700",
    "colour": "f0f1ea",
    "link": "https://cdn.discordapp.com/attachments/734604988717858846/738958095350366208/N700.jpg",
    "overview": "The N700 series is a Japanese Shinkansen high-speed train with tilting capability developed jointly by JR Central and JR West for use on the Tokaido and San'yō Shinkansen lines since 2007, and also operated by JR Kyushu on the Kyushu Shinkansen line. Further advancements led to the development of the N700A, an incremental evolution of the N700. Because of these improvements, trains can travel between Tokyo and Osaka on a Nozomi run in as little as 2 hours and 22 minutes on the fastest service (8 minutes faster than before). Currently, a second revision to the N700 series, the N700S, is undergoing testing and evaluation, with plans to begin replacing all other models from 2020. The first four sets began operation on 1 July 2020.",
    "constructed": 2005,
    "formation": "16 cars",
    "capacity": "1323 (1123 Standard, 200 Green)",
    "maximum_speed": "285 km/h (Tōkaidō) / 300 km/h (Sanyō) / 260 km/h (Kyushu)",
    "acceleration": "2.6 km/(h⋅s)",
    "length (m)": 404.7,
    "gauge (mm)": 1435,
    "lines_served": "Kyushu Shinkansen, Tōkaidō Shinkansen, Sanyō Shinkansen, Hakata-Minami Line"
  },
  {
    "name": "H5",
    "colour": "2ab59e",
    "link": "https://cdn.discordapp.com/attachments/734604988717858846/738958080662044722/H5.jpg",
    "overview": "The H5 series is a Japanese Shinkansen high-speed train type owned by Hokkaido Railway Company (JR Hokkaido) for use on Tohoku and Hokkaido Shinkansen services since 26 March 2016. Based on the earlier E5 series trains, a total of four 10-car sets were built by Hitachi and Kawasaki Heavy Industries at a cost of approximately 18 billion yen. The first two sets were delivered in October 2014. The H5 series is the first JR Hokkaido train type to use the \"H\" prefix, following the method used by JR East (with an \"E\" prefix).",
    "constructed": "2014-2015",
    "formation": "10 cars",
    "capacity": "723 (650 Standard, 55 Green, 18 Gran Class)",
    "maximum_speed": "320 km/h",
    "acceleration": "1.71 km/(h⋅s)",
    "length (m)": 253,
    "gauge (mm)": 1435,
    "lines_served": "Tōhoku Shinkansen, Hokkaido Shinkansen"
  },
  {
    "name": "L0",
    "colour": "f0f1ea",
    "link": "https://cdn.discordapp.com/attachments/734604988717858846/738958085611323522/L0.jpg",
    "overview": "The L0 Series is a high-speed maglev train that the Central Japan Railway Company (JR Central) is developing and testing. JR Central plans to use the L0 series on the Chūō Shinkansen railway line between Tokyo and Osaka, which is under construction. The L0 series uses the Japanese-designed SCMaglev system. A seven-car train set a land speed record for rail vehicles of 603 km/h (375 mph) on 21 April 2015. The trains are planned to run at a maximum speed of 505 km/h (314 mph), offering journey times of 40 minutes between Tokyo (Shinagawa Station) and Nagoya, and 1 hour 7 minutes between Tokyo and Osaka.",
    "constructed": "2011-Now",
    "formation": "16 cars",
    "capacity": "End cars: 24, Intermediate cars: 68",
    "maximum_speed": "505 km/h (Operating), 603 km/h (Record)",
    "acceleration": "N/A",
    "length (m)": "299 m (12 cars)",
    "gauge (mm)": "N/A",
    "lines_served": "Not in service at the moment"
  }
]