[
  {
    "name": "Kwun Tong",
    "abbrev": "KTL",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739960722863292426/KwunTong.jpg",
    "colour": "00ab4d",
    "overview": "The Kwun Tong line (Chinese: 觀塘綫) is a heavy-rail rapid transit line of the MTR network in Hong Kong, coloured green on the MTR map. The route has 17 stations and takes 35 minutes to complete. The Kwun Tong line is one of the busiest railway lines on the network, connecting the central and the eastern portions of Kowloon via Wong Tai Sin. The line is mostly underground, but includes a lengthy elevated section, and runs generally in an east-west direction. During the morning rush hour, the Kwun Tong line utilises 34 trains running at 2.1-minute-intervals.\n \nThe Kwun Tong Line is the first urban railway line in Hong Kong and the first operated by the Mass Transit Railway Corporation (MTRC), it has interchanges with four other lines: the Tsuen Wan line, the East Rail line, the Tuen Ma line, and the Tseung Kwan O line.",
    "route": "Whampoa to Tiu Keng Leng",
    "stations": 17,
    "running_time (mins)": 35,
    "length (km)": 18.4,
    "gauge (mm)": 1432,
    "train_formation": "8 cars",
    "rolling_stock": "Metro Cammell EMU (DC), CNR Changchun EMU",
    "opened": "1 October, 1979",
    "daily_ridership": 604600
  },
  {
    "name": "Tsuen Wan",
    "abbrev": "TWL",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739960722091671582/TsuenWan.jpg",
    "colour": "ee1d23",
    "overview": "The Tsuen Wan line (Chinese: 荃灣綫) is one of the eleven lines of the metro network in Hong Kong's MTR. It is indicated in red on the MTR map. There are 16 stations on the line. The southern terminus is Central station on Hong Kong Island and the northwestern terminus is Tsuen Wan station in the New Territories. A journey on the entire line takes 35 minutes. As a cross-harbour route that goes through the heart of Kowloon and densely populated Sham Shui Po and Kwai Chung, the line is very heavily travelled.",
    "route": "Central to Tsuen Wan",
    "stations": 16,
    "running_time (mins)": 32,
    "length (km)": 16.0,
    "gauge (mm)": 1432,
    "train_formation": "8 cars",
    "rolling_stock": "Metro Cammell EMU (DC)",
    "opened": "17 May, 1982",
    "daily_ridership": 1058300
  },
  {
    "name": "South Island",
    "abbrev": "SIL",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739960709172953198/SouthIsland.jpg",
    "colour": "c1cd25",
    "overview": "The South Island line (Chinese: 南港島綫), identified by the livery colour of light green, is a rapid transit line of Hong Kong's MTR metro system. This line connects the HK business district from Admiralty station to the Southern District of Hong Kong Island, which was not served by any rail transport prior to the opening of this line. The rolling_stock of South Island line is purpose-built for driverless operation. Trains are remotely controlled from the Operations Control Centre in Tsing Yi. This line was known during planning and construction as the South Island line (East) to distinguish from South Island line (West), which is still being planned and made in 2022.",
    "route": "Admiralty to South Horizons",
    "stations": 5,
    "running_time (mins)": 11,
    "length (km)": 7.4,
    "gauge (mm)": 1435,
    "train_formation": "3 cars",
    "rolling_stock": "CNR Changchun EMU",
    "opened": "28 December, 2016",
    "daily_ridership": "No data"
  },
  {
    "name": "Island",
    "abbrev": "ISL",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739960702978228234/Island.jpg",
    "colour": "017dc5",
    "overview": "The Island line (Chinese: 港島綫) is one of eleven lines of the MTR, the mass transit system in Hong Kong. It runs from Kennedy Town in Western to Chai Wan in the Eastern District. The line is indicated by the colour, dark blue, on the MTR map.\n \nThe Island line resembles the deep-level lines of the London Underground, as most of the route and stations along the line are deep underground and consist of cylindrical tunnels. This is the result of a lack of available land, as the construction plans for the line required it to be built under major roads. Because of the depth of the line, most underground stations on this line have curved walls on the platforms, which are due to the route's cylindrical tunnels, only with a greater diameter.",
    "route": "Kennedy Town to Chai Wan",
    "stations": 17,
    "running_time (mins)": 34,
    "length (km)": 16.3,
    "gauge (mm)": 1432,
    "train_formation": "8 cars",
    "rolling_stock": "Metro Cammell EMU (DC)",
    "opened": "31 May, 1985",
    "daily_ridership": 947100
  },
  {
    "name": "Tseung Kwan O",
    "abbrev": "TKL",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739960716945260544/TseungKwanO.jpg",
    "colour": "7d499c",
    "overview": "The Tseung Kwan O line (Chinese: 將軍澳綫) is one of the eleven lines of the MTR system in Hong Kong, indicated by the colour purple. The line runs from North Point on the Hong Kong Island to the new town of Tseung Kwan O. It bifurcates east of Tseung Kwan O station into two branches, one northward to Po Lam and one southward to LOHAS Park. The Tseung Kwan O Depot at LOHAS Park is responsible for the maintenance of the line's rolling_stock. During the morning peak period, the Tseung Kwan O line uses 15 trains to maintain a frequency of 2.5 minutes between Tseung Kwan O and North Point.",
    "route": "North Point to Po Lam / LOHAS Park",
    "stations": 8,
    "running_time (mins)": "15 (To Po Lam) / 20 (To LOHAS Park)",
    "length (km)": 12.3,
    "gauge (mm)": 1432,
    "train_formation": "8 cars",
    "rolling_stock": "Metro Cammell EMU (DC), Rotem EMU",
    "opened": "18 August, 2002",
    "daily_ridership": 333300
  },
  {
    "name": "Disneyland Resort",
    "abbrev": "DRL",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739960688268673024/Disneyland.jpg",
    "colour": "ef72aa",
    "overview": "The Disneyland Resort line (Chinese: 迪士尼綫) is a heavy rail MTR line connecting Sunny Bay to the Hong Kong Disneyland Resort, coloured pink on the network diagram. It is the seventh line of the former MTR network before the merger of MTR and KCR, and the world's first metro line designed to service a Disney theme park. There are only two stations on this line, Sunny Bay and Disneyland Resort, and the line operates as a shuttle service between these two stations. The rolling_stock is distinctive on account of its Mickey Mouse windows, interior couch seating, and Disneyland figurines displayed in the carriages.",
    "route": "Sunny Bay to Disneyland Resort",
    "stations": 2,
    "running_time (mins)": 5,
    "length (km)": 3,
    "gauge (mm)": 1432,
    "train_formation": "4 cars",
    "rolling_stock": "Metro Cammell EMU (DC) (Modified)",
    "opened": "1 August, 2005",
    "daily_ridership": 11000
  },
  {
    "name": "Tung Chung",
    "abbrev": "TCL",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739961103303573635/TungChung.jpg",
    "colour": "f7953e",
    "overview": "The Tung Chung line (Chinese: 東涌綫) is one of the eleven rapid transit lines of the MTR system in Hong Kong, linking the town of Tung Chung with central Hong Kong. A part of the Tung Chung line was built along with the Kap Shui Mun Bridge and the Tsing Ma Bridge. The line currently travels through eight stations in 29 minutes along its route. Unlike most other railway lines in the system, the Tung Chung Line travels mostly above ground and spans a greater distance. Trains run at a maximum speed of 135km/h. The line is coloured orange on the map.",
    "route": "Hong Kong to Tung Chung",
    "stations": 8,
    "running_time (mins)": 29,
    "length (km)": 31.1,
    "gauge (mm)": 1432,
    "train_formation": "8 cars",
    "rolling_stock": "Adtranz–CAF EMU, Rotem EMU",
    "opened": "21 June, 1998",
    "daily_ridership": 263900
  },
  {
    "name": "East Rail",
    "abbrev": "EAL",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739960699949678653/EastRail.jpg",
    "colour": "53b7e8",
    "overview": "The East Rail line (Chinese: 東鐵綫) is one of eleven rapid transit lines of the Mass Transit Railway (MTR) system in Hong Kong. It used to be one of the three lines of the Kowloon–Canton Railway (KCR) network. The railway line starts at Hung Hom station in Kowloon and branches in the north at Sheung Shui to terminate at Lo Wu or Lok Ma Chau stations. Both are border crossing points into Shenzhen. It is the longest line in total distance within the system network. The line is coloured light blue on the MTR map.\n \nA southern extension is under construction which will take the line under Victoria Harbour to a new terminus, Admiralty station, on Hong Kong Island. The extension, the centrepiece of the Sha Tin to Central Link expansion project, is due to be ready for service by 2022.",
    "route": "Hung Hom to Lo Wu / Lok Ma Chau",
    "stations": 14,
    "running_time (mins)": "45 (To Lo Wu), 50 (To Lok Ma Chau)",
    "length (km)": 41.5,
    "gauge (mm)": 1435,
    "train_formation": "12 cars",
    "rolling_stock": "Metro Cammell EMU (AC), SP1900 EMU",
    "opened": "1 October, 1910",
    "daily_ridership": 1044800
  },
  {
    "name": "West Rail",
    "abbrev": "WRL",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739960714562764820/WestRail.jpg",
    "colour": "a3218d",
    "overview": "The West Rail line (Chinese: 西鐵綫) is a rapid transit line that forms part of the Mass Transit Railway (MTR) system in Hong Kong. Coloured magenta on the MTR map, the line in its current form runs from Tuen Mun to Hung Hom. The railway connects the urban area of Kowloon and the new towns of Yuen Long, Tin Shui Wai and Tuen Mun in the northwestern New Territories. The line is the second of three lines built and operated by the Kowloon-Canton Railway Corporation (KCRC), then known as the KCR West Rail. It was designed to suburban rail standards similar to that of KCR's first line, now the East Rail line.\n \nSince KCRC's merger of operations with the MTR Corporation on 2 December 2007, the West Rail line has been operated as part of the MTR network. The line will be integrated into the Tuen Ma line by 2021 upon completion of Phase 1 of the Sha Tin to Central Link.",
    "route": "Hung Hom to Tuen Mun",
    "stations": 12,
    "running_time (mins)": 38,
    "length (km)": 35.7,
    "gauge (mm)": 1435,
    "train_formation": "8 cars",
    "rolling_stock": "SP1900/1950 EMU, East West line C-train",
    "opened": "20 December, 2003",
    "daily_ridership": 442600
  },
  {
    "name": "Tuen Ma",
    "abbrev": "TML",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739960714638262402/TuenMa.jpg",
    "colour": "913010",
    "overview": "The Tuen Ma line (Chinese: 屯馬綫) is a rapid transit line that forms part of the Mass Transit Railway (MTR) system in Hong Kong. Coloured brown on the MTR map, the line in its current form, designated as Tuen Ma Line Phase 1, runs from Kai Tak to Wu Kai Sha. When fully operational, the line will be 57 kilometres (35 mi) in length, making it the longest line of the entire MTR network. It will have a total of 27 stations, more than any other in the MTR system. This line is formerly called the Ma On Shan line.",
    "route": "Wu Kai Sha to Kai Tak",
    "stations": 12,
    "running_time (mins)": 28,
    "length (km)": 17.0,
    "gauge (mm)": 1435,
    "train_formation": "8 cars",
    "rolling_stock": "SP1900/1950 EMU, East West line C-train",
    "opened": "21 December, 2004",
    "daily_ridership": 153100
  },
  {
    "name": "Airport Express",
    "abbrev": "AEL",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739960696716132372/AirportExpress.jpg",
    "colour": "01888b",
    "overview": "The Airport Express (Chinese: 機場快綫) is one of the lines of the Hong Kong MTR system. It links the principal urban areas with the Hong Kong International Airport and the AsiaWorld–Expo exhibition and convention centre. It is not primarily a rapid transit or metro line but a premium-fare express service for the airport and exhibition centre. It uses specially designed rolling_stock intended to provide levels of comfort similar to that found on an airliner. The average maximum speed between stations is 135km/h.\n\nIt is the only rail link to the airport's terminal. It runs parallel to the Tung Chung line. The line continues to the airport and terminates at AsiaWorld–Expo. The line is coloured teal on MTR system maps.",
    "route": "Hong Kong to AsiaWorld-Expo",
    "stations": 5,
    "running_time (mins)": 28,
    "length (km)": 35.3,
    "gauge (mm)": 1432,
    "train_formation": "8 cars",
    "rolling_stock": "Adtranz–CAF EMU",
    "opened": "6 July, 1998",
    "daily_ridership": 54033
  }
]