[
  {
    "name": "Ginza",
    "abbrev": "G",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739281482647863326/Ginza.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/739277912552898690/Ginza_logo.png",
    "colour": "ff9500",
    "overview": "The Tokyo Metro Ginza Line is a subway line in Tokyo, Japan, operated by Tokyo Metro. The official name is Line 3 Ginza Line. It is 14.3 km long and serves the wards of Shibuya, Minato, Chūō, Chiyoda, and Taitō. It is the oldest subway line in Asia. The line was named after the Ginza commercial district in Chūō, Tokyo, under which it passes. On maps, diagrams and signboards, the line is shown using the color orange, and its stations are given numbers using the letter G.",
    "route": "Shibuya to Asakusa",
    "stations": 19,
    "length (km)": 14.3,
    "gauge (mm)": 1435,
    "train_formation": "6 cars",
    "opened": "30 December, 1927",
    "daily_ridership": 943606
  },
  {
    "name": "Marunouchi",
    "abbrev": "M",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739281482572365834/Marunouchi.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/739277915841232926/Marunouchi_logo.png",
    "colour": "f62e36",
    "overview": "The Tokyo Metro Marunouchi Line is a subway line in Tokyo, Japan, operated by Tokyo Metro. The line runs in a U-shape between Ogikubo Station in Suginami and Ikebukuro Station in Toshima, with a branch line between Nakano-Sakaue Station and Hōnanchō Station. The official name is Line 4 Marunouchi Line. The line was named after the Marunouchi business district in Chiyoda, Tokyo, under which it passes. On maps, diagrams and signboards, the line is shown using the color red, and its stations are given numbers using the letters M for the main line and Mb for the branch line.",
    "route": "Ogikubo to Ikebukuro, Nakano-Sakaue to Hōnanchō (Branch line)",
    "stations": 28,
    "length (km)": 27.4,
    "gauge (mm)": 1435,
    "train_formation": "6 cars",
    "opened": "20 January, 1954",
    "daily_ridership": 1159898
  },
  {
    "name": "Hibiya",
    "abbrev": "H",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739281479372242954/Hibiya.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/739277914599718952/Hibiya_logo.png",
    "colour": "b5b5ac",
    "overview": "The Tokyo Metro Hibiya Line is a subway line in Tokyo, Japan, owned and operated by Tokyo Metro. The line was named after the Hibiya area in Chiyoda's Yurakucho district, under which it passes. On maps, diagrams and signboards, the line is shown using the color silver, and its stations are given numbers using the letter H. The Hibiya Line was designed to serve a number of important districts, such as Ebisu, Roppongi, Tsukiji, Kayabachō and Senju, which were not on an existing line.",
    "route": "Naka-Meguro to Kita-Senju",
    "stations": 22,
    "length (km)": 20.3,
    "gauge (mm)": 1067,
    "train_formation": "7 cars",
    "opened": "28 March, 1961",
    "daily_ridership": 1213492
  },
  {
    "name": "Tozai",
    "abbrev": "T",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739281483231133798/Tozai.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/739277920111165510/Tozai_logo.png",
    "colour": "009bbf",
    "overview": "The Tokyo Metro Tōzai Line is a rapid transit line in Tokyo and Chiba Prefecture, Japan, owned and operated by Tokyo Metro. Its name literally means East-West Line. The line runs between Nakano Station in Nakano, Tokyo and Nishi-Funabashi Station in Funabashi, Chiba. The Tōzai Line was referred to as Line 5 during the planning stages, thus the seldom-used official name is Line 5 Tōzai Line. On average, the line carries 1,642,378 passengers daily (2017), the highest of all lines in the Tokyo Metro network. On maps, diagrams and signboards, the Tōzai Line is shown using the color sky blue, and its stations are given numbers using the letter T.",
    "route": "Nakano to Nishi-Funabashi",
    "stations": 23,
    "length (km)": 30.8,
    "gauge (mm)": 1067,
    "train_formation": "10 cars",
    "opened": "23 December, 1964",
    "daily_ridership": 1642378
  },
  {
    "name": "Chiyoda",
    "abbrev": "C",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739281459139051540/Chiyoda.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/739277909071757332/Chiyoda_logo.png",
    "colour": "00bb85",
    "overview": "The Tokyo Metro Chiyoda Line is a subway line owned and operated by Tokyo Metro in Tokyo, Japan. On average, the line carries 1,447,730 passengers daily (2017), the second highest of the Tokyo Metro network, behind the Tozai Line (1,642,378). The line was named after the Chiyoda ward, under which it passes. On maps, diagrams and signboards, the line is shown using the color green, and its stations are given numbers using the letter C.",
    "route": "Yoyogi-Uehara to Kita-Ayase",
    "stations": 20,
    "length (km)": 24.0,
    "gauge (mm)": 1067,
    "train_formation": "10 cars",
    "opened": "20 December, 1969",
    "daily_ridership": 1447730
  },
  {
    "name": "Yurakucho",
    "abbrev": "Y",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739281483499569262/Yurakucho.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/739277921952202783/Yurakucho_logo.png",
    "colour": "c1a470",
    "overview": "The Tokyo Metro Yūrakuchō Line is a subway line in Japan owned and operated by Tokyo Metro. The line connects Wakōshi Station in Wakō, Saitama and Shin-Kiba Station in Kōtō, Tokyo. On maps, diagrams and signboards, the line is shown using the color gold, and its stations are given numbers using the letter Y. The line was named after the Yūrakuchō business district in Chiyoda, Tokyo. The proper name as given in an annual report of the Ministry of Land, Infrastructure and Transport is Line No. 8 Yūrakuchō Line.",
    "route": "Wakōshi to Shin-Kiba",
    "stations": 24,
    "length (km)": 28.3,
    "gauge (mm)": 1067,
    "train_formation": "10 cars",
    "opened": "30 October, 1974",
    "daily_ridership": 1124478
  },
  {
    "name": "Hanzomon",
    "abbrev": "Z",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739281472258703371/Hanzomon.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/739277913609863168/Hanzomon_logo.png",
    "colour": "8f76d6",
    "overview": "The Tokyo Metro Hanzōmon Line is a subway line in Tokyo, Japan, owned and operated by Tokyo Metro. The 16.8 km line serves the wards of Shibuya, Minato, Chiyoda, Chūō, Kōtō, and Sumida. The line is named after the west gate of the Imperial Palace (Hanzōmon), which in turn is named after 16th century samurai Hattori Hanzō, who was important to the founding of the shogunate which built the palace. The Hanzōmon Line's color on maps and station guides is purple, and stations carry the prefix Z followed by a number.",
    "route": "Shibuya to Oshiage",
    "stations": 14,
    "length (km)": 16.8,
    "gauge (mm)": 1067,
    "train_formation": "10 cars",
    "opened": "1 August, 1978",
    "daily_ridership": 1006682
  },
  {
    "name": "Namboku",
    "abbrev": "N",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739281487563587604/Nanboku.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/739277917292462200/Nanboku_logo.png",
    "colour": "00ac9b",
    "overview": "The Tokyo Metro Namboku Line is a subway line owned and operated by Tokyo Metro in Tokyo, Japan. The line runs between Meguro in Shinagawa and Akabane-Iwabuchi in Kita. The Namboku Line was referred to as Line 7 during the planning stages, thus the seldom-used official name is Line 7 Namboku Line. On maps, diagrams and signboards, the line is shown using the color emerald (previously coded teal), and its stations are given numbers using the letter N.",
    "route": "Meguro to Akabane-Iwabuchi",
    "stations": 19,
    "length (km)": 21.3,
    "gauge (mm)": 1067,
    "train_formation": "6 cars",
    "opened": "29 November, 1991",
    "daily_ridership": 522736
  },
  {
    "name": "Fukutoshin",
    "abbrev": "F",
    "image": "https://cdn.discordapp.com/attachments/734604988717858846/739281464461492265/Fukutoshin.jpg",
    "logo": "https://cdn.discordapp.com/attachments/734604988717858846/739277911067983952/Futoshin_logo.png",
    "colour": "9c5e31",
    "overview": "The Tokyo Metro Fukutoshin Line, formally the No. 13 Fukutoshin Line, is a subway line operated by Tokyo Metro in west-central Tokyo and Wako, Saitama, Japan. The newest line in the Tokyo subway network, it opened in stages between 1994 and 2008. The Fukutoshin Line is the deepest metro line in Tokyo, with an average depth of 27 meters. It is the second Tokyo Metro line to feature express services, after the Tōzai Line.",
    "route": "Wakōshi to Shibuya",
    "stations": 16,
    "length (km)": 20.2,
    "gauge (mm)": 1067,
    "train_formation": "8 or 10 cars",
    "opened": "7 December, 1994",
    "daily_ridership": 362654
  }
]